In [2]:
import pandas as pd

In [6]:
rowdata={'id':[1,2,3,4,5],
        'fname':["Anil","Abhishek","Ashish","Ami","April"],
    'lname':["Apron","Au","Abd","Acid","Arc"]}

df1=pd.DataFrame(rowdata,columns=['id','fname','lname'])
df1

   id     fname  lname
0   1      Anil  Apron
1   2  Abhishek     Au
2   3    Ashish    Abd
3   4       Ami   Acid
4   5     April    Arc

In [8]:
rowdata={'id':[4,5,6,7,8],
        'fname':["Boss","Bose","Bashaa","Badam","Ball"],
    'lname':["Brinjal","Baloon","Beast","Cake","Jake"]}

df2=pd.DataFrame(rowdata,columns=['id','fname','lname'])
df2

   id   fname    lname
0   4    Boss  Brinjal
1   5    Bose   Baloon
2   6  Bashaa    Beast
3   7   Badam     Cake
4   8    Ball     Jake

In [11]:
pd.concat([df1,df2],axis=0)

   id     fname    lname
0   1      Anil    Apron
1   2  Abhishek       Au
2   3    Ashish      Abd
3   4       Ami     Acid
4   5     April      Arc
0   4      Boss  Brinjal
1   5      Bose   Baloon
2   6    Bashaa    Beast
3   7     Badam     Cake
4   8      Ball     Jake

In [13]:
pd.concat([df1,df2],axis=1)

   id     fname  lname  id   fname    lname
0   1      Anil  Apron   4    Boss  Brinjal
1   2  Abhishek     Au   5    Bose   Baloon
2   3    Ashish    Abd   6  Bashaa    Beast
3   4       Ami   Acid   7   Badam     Cake
4   5     April    Arc   8    Ball     Jake

In [19]:
pd.merge(df1,df2,how='inner',on='id')

   id fname_x lname_x fname_y  lname_y
0   4     Ami    Acid    Boss  Brinjal
1   5   April     Arc    Bose   Baloon

In [21]:
pd.merge(df1,df2,how='left',on='id')

   id   fname_x lname_x fname_y  lname_y
0   1      Anil   Apron     NaN      NaN
1   2  Abhishek      Au     NaN      NaN
2   3    Ashish     Abd     NaN      NaN
3   4       Ami    Acid    Boss  Brinjal
4   5     April     Arc    Bose   Baloon

In [23]:
pd.merge(df1,df2,how='outer',on='id')

   id   fname_x lname_x fname_y  lname_y
0   1      Anil   Apron     NaN      NaN
1   2  Abhishek      Au     NaN      NaN
2   3    Ashish     Abd     NaN      NaN
3   4       Ami    Acid    Boss  Brinjal
4   5     April     Arc    Bose   Baloon
5   6       NaN     NaN  Bashaa    Beast
6   7       NaN     NaN   Badam     Cake
7   8       NaN     NaN    Ball     Jake

In [24]:
pd.merge(df1,df2,how='right',on='id')

   id fname_x lname_x fname_y  lname_y
0   4     Ami    Acid    Boss  Brinjal
1   5   April     Arc    Bose   Baloon
2   6     NaN     NaN  Bashaa    Beast
3   7     NaN     NaN   Badam     Cake
4   8     NaN     NaN    Ball     Jake